**If you lost points on the last checkpoint you can get them back by responding to TA/IA feedback**  

Update/change the relevant sections where you lost those points, make sure you respond on GitHub Issues to your TA/IA to call their attention to the changes you made here.

Please update your Timeline... no battle plan survives contact with the enemy, so make sure we understand how your plans have changed.

# COGS 108 - Data Checkpoint

# Names

- Deena Pederson
- Vedika Harnathka
- Paola Sanchez
- Anne Pham
- Zoe Ludena

# Research Question

How have abortion rates changed in response to changes in various factors - such as the representation of female politicians, access to obstetric and gynecological (OB/GYN) care, and income levels - in the USA from 2014-2017? How will these factors help us predict future abortion rates in the foreseeable future?

## Background and Prior Work


To be more specific in our research, the definition in which we are abiding by the term “women in governing bodies” are women who are in the respective current state legislature. Throughout our data we will look at all U.S. territories excluding Guam, U.S. Virgin Islands, and the District of Columbia. However, we will be using 3 states as markers and general comparisons to the data: 1) having the highest percentage of women in their state legislature, 2) having the lowest percentage of women in their state legislature, and 3) having the median percentage of women in their state legislature. While proceeding with our research, if we have the time and data to do so, we would love to delve deeper into any possible outliers within the states.

One of the first considerations to be made is which states have higher female representation and which have less. We can note that in all 50 states males are over represented while females are underrepresented.[^1] This data splits the measures into two separate categories; state legislatures. Overall Vermont, Maine, and Rhode Island notably have the smallest disparities, while North Dakota, South Dakota, and Nebraska have the highest.

A study done by the National Partnership for Women & Families[^2] states with a higher representation of female legislators are more likely to adopt abortion protection policies. This study considers 2 categories of representation in legislation: states where women make up more than a third of the members, and states where women make up less than a third of members. They found that of the prior, 84% of these states have policies that support abortion access while the former only has 15%. They also consider how the ethnic diversity in these women may also correlate.

Subsequently, female health is a very general statement, therefore we decided to focus on OB/GYN access. We believe that this may yield some type of correlation between abortion rates. We believe that there will be some type of existing correlation between this accessibility and abortion rates. Additionally, another factor that we must consider are average income rates. In the article, *Rural-urban differences in access to hospital obstetric and neonatal care: how far is the closest one?*, their general conclusion is that: “Women in communities that are already socioeconomically disadvantaged face increasing and substantial travel distances to access perinatal care.[^3] (Hung et al.)

[^1]: Wolf, C. (2022, August 25). [Best States for Gender Equality: Representation and Power](https://www.usnews.com/news/best-states/articles/best-states-for-gender-equality-representation-power#:~:text=Vermont%2C%20Maine%20and%20Maryland%20have,women%20compared%20to%2038.1%25%20men)

[^2]: Lack of Representation by Women in State Legislatures Threatens Abortion Access. (n.d.). National Partnership for Women & Families. Retrieved February 12, 2024, from [source](https://nationalpartnership.org/news_post/lack-of-representation-women-state-legislatures-threatens-abortion-access/#:~:text=Of%20the%2024%20states%20and)

[^3]: Hung, P., Casey, M. M., Kozhimannil, K. B., Karaca-Mandic, P., & Moscovice, I. S. (2018). [Rural-urban differences in access to hospital obstetric and neonatal care: how far is the closest one?](https://doi.org/10.1038/s41372-018-0063-5)

# Hypothesis


Proportionately higher representation of females in state government, lower income level, and higher concentration of OBGYN  correlates to states with higher rates of abortion.
We think that with higher representation and advocacy from women in governmental positions of power, this will be reflected through policies allowing for increased access to abortion. 
Additionally, areas with lower income may have financial burdens not suitable for raising a child, as well as limited access to affordable healthcare and contraceptives. Finally, a higher concentration of OBGYN will correlate to higher access to abortion services and healthcare professionals.

# Data

## Data overview

For each dataset include the following information
- Dataset #1
  - Dataset Name:
  - Link to the dataset:
  - Number of observations:
  - Number of variables:
- Dataset #2 (if you have more than one!)
  - Dataset Name:
  - Link to the dataset:
  - Number of observations:
  - Number of variables:
- etc

Now write 2 - 5 sentences describing each dataset here. Include a short description of the important variables in the dataset; what the metrics and datatypes are, what concepts they may be proxies for. Include information about how you would need to wrangle/clean/preprocess the dataset

If you plan to use multiple datasets, add a few sentences about how you plan to combine these datasets.

**Dataset #1: Abortion Incidence**


Link: https://www.guttmacher.org/report/abortion-incidence-service-availability-us-2017 


Table 1 contains the number of reported abortions, abortion rate, and abortion ratio in the United States from the years 2000-2017. To clean this table we removed the brackets and commas so that the No. of abortions (in 000’s), Rate, and Ratio could be converted to floats. 
- `aisau1` Number of Observations: 18
- `aisau1` Number of Variables: 4

Table 2 contains the number of reported abortions and abortion rate in 2014, 2016, and 2017 by region and state. There is also a percentage change from 2014 to 2017. The only cleaning required for this dataset was removing the commas in the data. 
- `aisau2` Number of Observations: 56
- `aisau2` Number of Variables: 8

Table 3 provides information about the number and percentage of abortion providers by type and caseload for the years 2014 and 2017. We cleaned this data by removing the commas from the 'Facilities No. 2014', 'Facilities No. 2017', 'Abortions No. 2014',  and 'Abortions No. 2017' columns.
- `aisau3` Number of Observations: 10
- `aisau3` Number of Variables: 9

Table 4 holds the total number of abortion clinics, the percentage of counties without a clinic, and percentage of women living in these counties, by state and region in the years 2014 and 2017. This dataset did not require any further cleaning since all the values were integers.
- `aisau4` Number of Observations: 56
- `aisau4` Number of Variables: 6

Table 5 provides information about the number of abortion clinics in 2014 and 2017 and the percentage change between these years. Additionally, it contains the abortion rate in 2014 and 2017 and the change between these years. It is focused on the states with the proportionately largest decrease in number of clinics and increase in number of clinics. 'Abortion rate 2014', 'Abortion rate 2017' were cleaned by removing commas. 
- `aisau5` Number of Observations: 21
- `aisau5` Number of Variables: 9

Table 6 contains the number of medication abortions, among facilities offering only early medication abortions. We removed the commas and switched the objects to floats.  
- `aisau6` Number of Observations: 8
- `aisau6` Number of Variables: 4

Some of the notable variables in this dataset include the abortion rate by state and region, as well as the number of abortion providers by time and region.

**Dataset #2: Median Household Income by State**
- Link: https://nces.ed.gov/programs/digest/d16/tables/dt16_102.30.asp
- Number of Observations: 52
- `mhis` (1990-2015) Number of Variables: 17
- `mhis2`  (2015-2021) Number of Variables: 19

This dataset contains information about the median household income in the United States as a whole, as well as broken down by individual states. It contains data for the years 1990- 2015, and 2015-2021 (excluding 2020) with the median for each year as well as the standard error for each year. To clean this dataset, we needed to remove the dollar signs (present in doubles $$) as well as the parentheses to convert appropriate variables to floats. Some of the key information we will utilize from this dataset is from the years 2014-2017 since that is when our first dataset is focused on.

**Dataset #3: History of Women in the US Congress**

- Link: https://cawp.rutgers.edu/facts/levels-office/congress/history-women-us-congress
- `congress` Number of Observations: 54
- `congress` Number of Variables: 6

This dataset provides information on the number of women in the senate, women in the house, and total women in congress over 2 year terms. The information provided was an object with the number of women in each of these categories and then in parentheses specified if these were made up of democrats or republicans. We cleaned this data by splitting each of these 3 data points into 3 more subcategories to identify the number of democrat, republican, and total women in the Senate, House, and Congress.

**Dataset #4: OB/GYN Rate Per State, 2019-2021**

- Link: https://data.hrsa.gov/topics/health-workforce/ahrf
- `obgyn` Number of Observations: 60
- `obgyn` Number of Variables: 5

This dataset provides information on the rate of OB/GYNs per state from 2019 to 2021. This rate is per 100,000 population, from the HRSA (Health Resources and Services Organization). The data from each year was downloaded as a separate csv file, cleaned to include only the state name and the rate for that year, and then merged into one dataset with all three years.

*Note*: The years are not consistent with the rest of the data currently, but we have requested the source for data for years 2014-2017. The data will look very similar so the cleaning/merging should look exactly the same as it does right now.

**How we will combine the data:**

We plan on combining the data by using `.merge()`. We will isolate the years we want to use (which will be 2014-2017 because we have consistent data for those years) and format them in a way that allows for `.merge()` to happen. This means we will expect to have repeating datapoints for the smaller tables. We might have to `.transpose()` DataFrames. This is because some of our columns are years and some of our rows are years. Another way we could work around this issue is by saving the Series or rows into arrays and re-assigning them via `.iloc()` or `.assign()`.

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
# Get the current working directory (allows for everyone to pull it without formatting issues)
current_dir = os.getcwd()
data_folder = os.path.join(current_dir, 'data')

# The different CSV files we will be using file paths
aisau1 = "abortion-incidence-service-availability-us-2017-table_1.csv"
aisau2 = "abortion-incidence-service-availability-us-2017-table_2.csv"
aisau3 = "abortion-incidence-service-availability-us-2017-table_3.csv"
aisau4 = "abortion-incidence-service-availability-us-2017-table_4.csv"
aisau5 = "abortion-incidence-service-availability-us-2017-table_5.csv"
aisau6 = "abortion-incidence-service-availability-us-2017-table_6.csv"
mhis = "median-household-income-by-state.csv"
mhis2 = "tabn102.30.csv"
congress = "paragraph_1009_field_table_und_0.csv"
obgyn1 = "AHRFDashboard_2019.csv"
obgyn2 = "AHRFDashboard_2020.csv"
obgyn3 = "AHRFDashboard_2021.csv"

# Using os to make the file path

#These are from the Abortion Rates link
aisau1_fp = os.path.join(data_folder, aisau1)
aisau2_fp = os.path.join(data_folder, aisau2)
aisau3_fp = os.path.join(data_folder, aisau3)
aisau4_fp = os.path.join(data_folder, aisau4)
aisau5_fp = os.path.join(data_folder, aisau5)
aisau6_fp = os.path.join(data_folder, aisau6)

#This is from the Median Household Income by State link
mhis_fp = os.path.join(data_folder, mhis)
mhis_fp2 = os.path.join(data_folder, mhis2)

#This is from https://cawp.rutgers.edu/facts/levels-office/congress/history-women-us-congress
congress_fp = os.path.join(data_folder, congress)

#We still need more congress data and the OBGYN data
obgyn1_fp = os.path.join(data_folder, obgyn1)
obgyn2_fp = os.path.join(data_folder, obgyn2)
obgyn3_fp = os.path.join(data_folder, obgyn3)

# Making DataFrames
aisau1 = pd.read_csv(aisau1_fp, sep = "|")
aisau2 = pd.read_csv(aisau2_fp, sep = "|")
aisau3 = pd.read_csv(aisau3_fp, sep = "|")
aisau4 = pd.read_csv(aisau4_fp, sep = "|")
aisau5 = pd.read_csv(aisau5_fp, sep = "|")
aisau6 = pd.read_csv(aisau6_fp, sep = "|")
mhis = pd.read_csv(mhis_fp, sep = "|")
mhis2 = pd.read_csv(mhis_fp2, sep = "|")
congress = pd.read_csv(congress_fp)
obgyn1 = pd.read_csv(obgyn1_fp)
obgyn2 = pd.read_csv(obgyn2_fp)
obgyn3 = pd.read_csv(obgyn3_fp)

### Cleaning Functions:

In [3]:
def remove_commas(df, columns): 
    #removes commas from specified columns in a df & converts them to float
    for column in columns: 
        df[column] = df[column].replace(',', '', regex = True).astype(float)
        
#use as such: remove_commas(df, ['column1', 'column2'])

In [4]:
def remove_dollar_sign(df, columns): 
    #removes dollar signs ('$') from specified columns in a df 
    for column in columns: 
        df[column] = df[column].replace('[\$,]', '', regex = True)

#use as such: remove_dollar_sign(df, ['column1', 'column2'])

In [5]:
def remove_parentheses(df, columns): 
    #removes parantheses from specified columns in a df
    for column in columns: 
        df[column] = df[column].replace('[\(\)]', '', regex=True)
        
#use as such: remove_parentheses(df, ['column1', 'column2'])

In [6]:
def remove_brackets(df, columns): 
    #removes brackets from specified columns in df 
    for column in columns: 
        df[column] = df[column].replace('[\[\]]', '', regex = True)
        
#use as such: remove_brackets(df, ['column1', 'column2'])

## Dataset #1 Abortion Incidence

### Table 1

In [7]:
aisau1.shape

(18, 4)

In [8]:
aisau1.head()

   Year No. (in 000s)    Rate   Ratio
0  2000       1,313.0    21.3    24.5
1  2001     [1,291.0]  [20.9]  [24.4]
2  2002     [1,269.0]  [20.5]  [23.8]
3  2003     [1,250.0]  [20.2]  [23.3]
4  2004       1,222.1    19.7    22.9

In [9]:
aisau1.dtypes

Year              int64
No. (in 000s)    object
Rate             object
Ratio            object
dtype: object

In [10]:
remove_brackets(aisau1, ['No. (in 000s)', 'Rate', 'Ratio'])
remove_commas(aisau1, ['No. (in 000s)', 'Rate', 'Ratio'])

In [11]:
aisau1.head()

   Year  No. (in 000s)  Rate  Ratio
0  2000         1313.0  21.3   24.5
1  2001         1291.0  20.9   24.4
2  2002         1269.0  20.5   23.8
3  2003         1250.0  20.2   23.3
4  2004         1222.1  19.7   22.9

In [12]:
aisau1.dtypes

Year               int64
No. (in 000s)    float64
Rate             float64
Ratio            float64
dtype: object

In [13]:
# aisau1["No. (in 000s)"] = aisau1["No. (in 000s)"].apply(remove_brackets)
# aisau1["Rate"] = aisau1["Rate"].apply(remove_brackets)
# aisau1["Ratio"] = aisau1["Ratio"].apply(remove_brackets)

### Table 2

In [14]:
aisau2.shape

(56, 8)

In [15]:
aisau2.head()

,Region and State,No. 2014,No. 2016,No. 2017,Rate 2014,Rate 2016,Rate 2017,% change 2014-2017
0,U.S. total,"926,190","874,080","862,320",14.6,13.7,13.5,-8
1,Northeast,"240,320","232,040","224,310",21.8,21.2,20.5,-6
2,Connecticut,"13,140","12,210","11,910",19.2,18.1,17.7,-8
3,Maine,"2,220","2,060","2,040",9.5,8.9,8.8,-7
4,Massachusetts,"21,020","19,200","18,590",15.3,14.0,13.5,-12

In [16]:
aisau2.dtypes

Region and State       object
No. 2014               object
No. 2016               object
No. 2017               object
Rate 2014             float64
Rate 2016             float64
Rate 2017             float64
% change 2014-2017      int64
dtype: object

In [17]:
remove_commas(aisau2, ["No. 2014", "No. 2016", "No. 2017"])

In [18]:
aisau2.head()

,Region and State,No. 2014,No. 2016,No. 2017,Rate 2014,Rate 2016,Rate 2017,% change 2014-2017
0,U.S. total,926190.0,874080.0,862320.0,14.6,13.7,13.5,-8
1,Northeast,240320.0,232040.0,224310.0,21.8,21.2,20.5,-6
2,Connecticut,13140.0,12210.0,11910.0,19.2,18.1,17.7,-8
3,Maine,2220.0,2060.0,2040.0,9.5,8.9,8.8,-7
4,Massachusetts,21020.0,19200.0,18590.0,15.3,14.0,13.5,-12

In [19]:
aisau2.dtypes

Region and State       object
No. 2014              float64
No. 2016              float64
No. 2017              float64
Rate 2014             float64
Rate 2016             float64
Rate 2017             float64
% change 2014-2017      int64
dtype: object

### Table 3

In [20]:
aisau3.shape

(10, 9)

In [21]:
aisau3.head()

,Unnamed,Facilities No. 2014,Facilities No. 2017,Facilities % 2014,Facilities % 2017,Abortions No. 2014,Abortions No. 2017,Abortions % 2014,Abortions % 2017
Facility type,Total,"1,671","1,587",100,100,"926,190","862,320",100,100
Facility type,Hospital,638,518,38,33,"34,410","28,760",4,3
Facility type,Abortion clinic,272,253,16,16,"547,130","519,180",59,60
Facility type,Nonspecialized clinic,517,555,31,35,"331,790","302,860",36,35
Facility type,Physicians' office,244,261,15,16,"12,870","11,510",1,1

In [22]:
aisau3.dtypes

Unnamed                object
Facilities No. 2014    object
Facilities No. 2017    object
Facilities % 2014       int64
Facilities % 2017       int64
Abortions No. 2014     object
Abortions No. 2017     object
Abortions % 2014        int64
Abortions % 2017        int64
dtype: object

In [23]:
remove_commas(aisau3, ['Facilities No. 2014', 'Facilities No. 2017', 
                       'Abortions No. 2014', 'Abortions No. 2017'])

In [24]:
aisau3.head()

,Unnamed,Facilities No. 2014,Facilities No. 2017,Facilities % 2014,Facilities % 2017,Abortions No. 2014,Abortions No. 2017,Abortions % 2014,Abortions % 2017
Facility type,Total,1671.0,1587.0,100,100,926190.0,862320.0,100,100
Facility type,Hospital,638.0,518.0,38,33,34410.0,28760.0,4,3
Facility type,Abortion clinic,272.0,253.0,16,16,547130.0,519180.0,59,60
Facility type,Nonspecialized clinic,517.0,555.0,31,35,331790.0,302860.0,36,35
Facility type,Physicians' office,244.0,261.0,15,16,12870.0,11510.0,1,1

In [25]:
aisau3.dtypes

Unnamed                 object
Facilities No. 2014    float64
Facilities No. 2017    float64
Facilities % 2014        int64
Facilities % 2017        int64
Abortions No. 2014     float64
Abortions No. 2017     float64
Abortions % 2014         int64
Abortions % 2017         int64
dtype: object

### Table 4

In [26]:
aisau4.shape

(56, 6)

In [27]:
aisau4.head()

,Region and state,No. of clinics 2014,No. of clinics 2017,% change 2014-2017,"% of counties without a clinic, 2017","% of women in counties with no clinic, 2017"
0,U.S. total,789,808,2,89,38
1,Northeast,212,245,16,54,21
2,Connecticut,25,26,4,13,5
3,Maine,4,16,300,31,24
4,Massachusetts,14,19,36,43,13

In [28]:
aisau4.dtypes

Region and state                               object
No. of clinics 2014                             int64
No. of clinics 2017                             int64
% change 2014-2017                              int64
% of counties without a clinic, 2017            int64
% of women in counties with no clinic, 2017     int64
dtype: object

### Table 5

In [29]:
aisau5.shape

(21, 9)

In [30]:
aisau5.head()

,Prop Num of Clinics Decline/Increase,Location,No. of clinics 2014,No. of clinics 2017,No. of clinics % change,Abortion rate 2014,Abortion rate 2017,Abortion rate % change,Total no. of new restrictions in effect 2014–2017
0,NaN,U.S. total,789,808,2,14.6,13.5,-8,196
1,10 states with proportionately largest decline...,Kentucky,2,1,-50,4.1,3.8,-9,3
2,10 states with proportionately largest decline...,West Virginia,2,1,-50,6.0,4.4,-26,6
3,10 states with proportionately largest decline...,Indiana,9,6,-33,6.3,5.9,-6,20
4,10 states with proportionately largest decline...,Iowa,12,8,-33,7.5,6.3,-15,9

In [31]:
aisau5.dtypes

Prop Num of Clinics Decline/Increase                  object
Location                                              object
No. of clinics 2014                                    int64
No. of clinics 2017                                    int64
No. of clinics % change                                int64
Abortion rate 2014                                   float64
Abortion rate 2017                                   float64
Abortion rate % change                                 int64
Total no. of new restrictions in effect 2014–2017      int64
dtype: object

In [32]:
remove_commas(aisau5, ['Abortion rate 2014', 'Abortion rate 2017'])

In [33]:
aisau5.head()

,Prop Num of Clinics Decline/Increase,Location,No. of clinics 2014,No. of clinics 2017,No. of clinics % change,Abortion rate 2014,Abortion rate 2017,Abortion rate % change,Total no. of new restrictions in effect 2014–2017
0,NaN,U.S. total,789,808,2,14.6,13.5,-8,196
1,10 states with proportionately largest decline...,Kentucky,2,1,-50,4.1,3.8,-9,3
2,10 states with proportionately largest decline...,West Virginia,2,1,-50,6.0,4.4,-26,6
3,10 states with proportionately largest decline...,Indiana,9,6,-33,6.3,5.9,-6,20
4,10 states with proportionately largest decline...,Iowa,12,8,-33,7.5,6.3,-15,9

### Table 6

In [34]:
aisau6.shape

(8, 4)

In [35]:
aisau6.head()

,Unnamed,No. of medication abortions,Offering only early medication abortion No.,Offering only early medication abortion % of all nonhospital providers
NaN,U.S. total,"339,640",269,25
Facility type,Physicians' office,"5,020",30,11
Facility type,Nonspecialized clinic,"153,350",229,41
Facility type,Abortion clinic,"181,280",10,4
Facility caseload,1-29,"1,230",57,24

In [36]:
aisau6.dtypes

Unnamed                                                                   object
No. of medication abortions                                               object
Offering only early medication abortion No.                                int64
Offering only early medication abortion % of all nonhospital providers     int64
dtype: object

In [37]:
remove_commas(aisau6, ['No. of medication abortions'])

In [38]:
aisau6.head()

,Unnamed,No. of medication abortions,Offering only early medication abortion No.,Offering only early medication abortion % of all nonhospital providers
NaN,U.S. total,339640.0,269,25
Facility type,Physicians' office,5020.0,30,11
Facility type,Nonspecialized clinic,153350.0,229,41
Facility type,Abortion clinic,181280.0,10,4
Facility caseload,1-29,1230.0,57,24

In [39]:
aisau6.dtypes

Unnamed                                                                    object
No. of medication abortions                                               float64
Offering only early medication abortion No.                                 int64
Offering only early medication abortion % of all nonhospital providers      int64
dtype: object

## Dataset #2 Median household income, by state: Selected years, 1990 through 2015

### Up to 2015

In [40]:
mhis.shape

(52, 17)

In [41]:
mhis.head() #SE means standard error

,State,1990,2000,2005,2005 (SE),2010,2010 (SE),2011,2011 (SE),2012,2012 (SE),2013,2013 (SE),2014,2014 (SE),2015,2015 (SE)
0,United States,"$$55,500","$$59,800","$$56,100",($$80),"$$54,400",($$40),"$$53,200",($$50),"$$53,000",($$30),"$$53,200",($$40),"$$53,700",($$60),"$$55,800",($$50)
1,Alabama,"$$43,600","$$48,600","$$44,800",($$390),"$$44,000",($$310),"$$43,600",($$350),"$$42,900",($$300),"$$43,600",($$400),"$$42,900",($$360),"$$44,800",($$450)
2,Alaska,"$$76,400","$$73,400","$$68,200","($$1,330)","$$70,200","($$1,380)","$$71,500","($$1,250)","$$69,900","($$1,190)","$$73,500","($$1,170)","$$71,700","($$1,090)","$$73,400","($$1,410)"
3,Arizona,"$$50,800","$$57,700","$$53,700",($$480),"$$50,900",($$350),"$$49,200",($$350),"$$49,400",($$380),"$$49,400",($$360),"$$50,100",($$290),"$$51,500",($$260)
4,Arkansas,"$$39,000","$$45,800","$$42,500",($$440),"$$41,600",($$420),"$$40,800",($$490),"$$41,400",($$310),"$$41,200",($$440),"$$41,300",($$400),"$$42,000",($$290)

In [42]:
mhis.dtypes

State        object
1990         object
2000         object
2005         object
2005 (SE)    object
2010         object
2010 (SE)    object
2011         object
2011 (SE)    object
2012         object
2012 (SE)    object
2013         object
2013 (SE)    object
2014         object
2014 (SE)    object
2015         object
2015 (SE)    object
dtype: object

In [43]:
remove_dollar_sign(mhis, ['1990', '2000', '2005', '2005 (SE)', '2010', 
                         '2010 (SE)', '2011', '2011 (SE)', '2012', '2012 (SE)', 
                         '2013', '2013 (SE)', '2014', '2014 (SE)', '2015', '2015 (SE)'])

remove_parentheses(mhis, ['2005 (SE)', '2010 (SE)', '2011 (SE)', '2012 (SE)', 
                          '2013 (SE)', '2014 (SE)', '2015 (SE)'])

mhis = mhis.astype(float, errors = 'ignore')

In [44]:
mhis.head()

,State,1990,2000,2005,2005 (SE),2010,2010 (SE),2011,2011 (SE),2012,2012 (SE),2013,2013 (SE),2014,2014 (SE),2015,2015 (SE)
0,United States,55500.0,59800.0,56100.0,80.0,54400.0,40.0,53200.0,50.0,53000.0,30.0,53200.0,40.0,53700.0,60.0,55800.0,50.0
1,Alabama,43600.0,48600.0,44800.0,390.0,44000.0,310.0,43600.0,350.0,42900.0,300.0,43600.0,400.0,42900.0,360.0,44800.0,450.0
2,Alaska,76400.0,73400.0,68200.0,1330.0,70200.0,1380.0,71500.0,1250.0,69900.0,1190.0,73500.0,1170.0,71700.0,1090.0,73400.0,1410.0
3,Arizona,50800.0,57700.0,53700.0,480.0,50900.0,350.0,49200.0,350.0,49400.0,380.0,49400.0,360.0,50100.0,290.0,51500.0,260.0
4,Arkansas,39000.0,45800.0,42500.0,440.0,41600.0,420.0,40800.0,490.0,41400.0,310.0,41200.0,440.0,41300.0,400.0,42000.0,290.0

In [45]:
mhis.dtypes

State         object
1990         float64
2000         float64
2005         float64
2005 (SE)    float64
2010         float64
2010 (SE)    float64
2011         float64
2011 (SE)    float64
2012         float64
2012 (SE)    float64
2013         float64
2013 (SE)    float64
2014         float64
2014 (SE)    float64
2015         float64
2015 (SE)    float64
dtype: object

### 2015 to 2021 (Missing 2020)

In [46]:
mhis2.shape

(52, 19)

In [47]:
mhis2.head()

,State,1990,2000,2005,2005 (SE),2010,2010 (SE),2015,2015 (SE),2016,2016 (SE),2017,2017 (SE),2018,2018 (SE),2019,2019 (SE),2021,2021 (SE)
0,United States,"$63,600","$68,500","$64,300",(90),"$62,300",(50),"$63,800",(60),"$65,100",(80),"$66,700",(60),"$66,800",(60),"$69,600",(80),"$69,700",(80)
1,Alabama,"$49,900","$55,700","$51,300",(450),"$50,400",(360),"$51,200",(520),"$52,200",(460),"$53,200",(520),"$53,800",(510),"$54,800",(390),"$53,900",(470)
2,Alaska,"$87,600","$84,100","$78,200","(1,530)","$80,400","(1,580)","$83,900","(1,610)","$86,300","(1,530)","$80,900","(1,770)","$80,200","(1,500)","$80,000","(1,740)","$77,800","(1,310)"
3,Arizona,"$58,300","$66,200","$61,600",(550),"$58,300",(400),"$58,900",(300),"$60,500",(440),"$62,500",(350),"$63,900",(480),"$65,800",(290),"$69,100",(420)
4,Arkansas,"$44,700","$52,500","$48,700",(510),"$47,700",(490),"$48,000",(330),"$50,100",(630),"$50,700",(510),"$50,800",(470),"$51,900",(560),"$52,500",(610)

In [48]:
mhis2.dtypes

State        object
1990         object
2000         object
2005         object
2005 (SE)    object
2010         object
2010 (SE)    object
2015         object
2015 (SE)    object
2016         object
2016 (SE)    object
2017         object
2017 (SE)    object
2018         object
2018 (SE)    object
2019         object
2019 (SE)    object
2021         object
2021 (SE)    object
dtype: object

In [49]:
remove_dollar_sign(mhis2, ['1990', '2000', '2005', '2005 (SE)', '2010', '2010 (SE)', 
                          '2015', '2015 (SE)', '2016', '2016 (SE)', '2017', '2017 (SE)', 
                          '2018', '2018 (SE)', '2019', '2019 (SE)', '2021', '2021 (SE)'])

remove_parentheses(mhis2, ['2005 (SE)', '2010 (SE)', '2015 (SE)','2016 (SE)','2017 (SE)', 
                          '2018 (SE)','2019 (SE)','2021 (SE)'])

mhis2 = mhis2.astype(float, errors = 'ignore')

In [50]:
mhis2.head()

,State,1990,2000,2005,2005 (SE),2010,2010 (SE),2015,2015 (SE),2016,2016 (SE),2017,2017 (SE),2018,2018 (SE),2019,2019 (SE),2021,2021 (SE)
0,United States,63600.0,68500.0,64300.0,90.0,62300.0,50.0,63800.0,60.0,65100.0,80.0,66700.0,60.0,66800.0,60.0,69600.0,80.0,69700.0,80.0
1,Alabama,49900.0,55700.0,51300.0,450.0,50400.0,360.0,51200.0,520.0,52200.0,460.0,53200.0,520.0,53800.0,510.0,54800.0,390.0,53900.0,470.0
2,Alaska,87600.0,84100.0,78200.0,1530.0,80400.0,1580.0,83900.0,1610.0,86300.0,1530.0,80900.0,1770.0,80200.0,1500.0,80000.0,1740.0,77800.0,1310.0
3,Arizona,58300.0,66200.0,61600.0,550.0,58300.0,400.0,58900.0,300.0,60500.0,440.0,62500.0,350.0,63900.0,480.0,65800.0,290.0,69100.0,420.0
4,Arkansas,44700.0,52500.0,48700.0,510.0,47700.0,490.0,48000.0,330.0,50100.0,630.0,50700.0,510.0,50800.0,470.0,51900.0,560.0,52500.0,610.0

In [51]:
mhis2.dtypes

State         object
1990         float64
2000         float64
2005         float64
2005 (SE)    float64
2010         float64
2010 (SE)    float64
2015         float64
2015 (SE)    float64
2016         float64
2016 (SE)    float64
2017         float64
2017 (SE)    float64
2018         float64
2018 (SE)    float64
2019         float64
2019 (SE)    float64
2021         float64
2021 (SE)    float64
dtype: object

## Dataset #3: History of Women in the U.S. Congress

In [52]:
congress.shape

(54, 6)

In [53]:
congress = congress.drop(columns = ["0"], axis = 1) #Removing index provided

In [54]:
congress.head() #D means Democrat and R means Republican

  Congress      Dates Women in the Senate Women in the House Total Women
0     65th  1917-1919          0 (0D, 0R)         1 (0D, 1R)  1 (0D, 1R)
1     66th  1919-1921          0 (0D, 0R)         0 (0D, 0R)  0 (0D, 0R)
2     67th  1921-1923          1 (1D, 0R)         3 (0D, 3R)  4 (1D, 3R)
3     68th  1923-1925          0 (0D, 0R)         1 (0D, 1R)  1 (0D, 1R)
4     69th  1925-1927          0 (0D, 0R)         3 (1D, 2R)  3 (1D, 2R)

In [55]:
congress.dtypes

Congress               object
Dates                  object
Women in the Senate    object
Women in the House     object
Total Women            object
dtype: object

In [56]:
#Removing these rows because they are not needed for our analysis and caused some cleaning problems, as they were not uniform
congress.drop(53, inplace = True)
congress.drop(52, inplace = True)

In [57]:
congress["Start Date"] = congress["Dates"].apply(lambda string: int(string.split("-")[0]))
congress["End Date"] = congress["Dates"].apply(lambda string: int(string.split("-")[1]))
# congress = congress.drop(columns = ["Dates"], axis = 1)
congress["Total Women in Senate"] = congress["Women in the Senate"].apply(lambda string: int(string.split(" ")[0]))
congress["Democratic Women in Senate"] = congress["Women in the Senate"].apply(lambda string:
                                                                    int(string[string.find("(") + 1:string.find(")")].split(",")[0].replace("D", "")))
congress["Republican Women in Senate"] = congress["Women in the Senate"].apply(lambda string:
                                                                    int(string[string.find("(") + 1:string.find(")")].split(",")[-1].replace("R", "")))
congress["Total Women in House"] = congress["Women in the House"].apply(lambda string: int(string.split(" ")[0]))
congress["Democratic Women in House"] = congress["Women in the House"].apply(lambda string:
                                                                    int(string[string.find("(") + 1:string.find(")")].split(",")[0].replace("D", "")))
congress["Republican Women in House"] = congress["Women in the House"].apply(lambda string:
                                                                    int(string[string.find("(") + 1:string.find(")")].split(",")[-1].replace("R", "")))
congress["Total Women in Congress"] = congress["Total Women"].apply(lambda string: int(string.split(" ")[0]))
congress["Total Democratic Women"] = congress["Total Women"].apply(lambda string:
                                                                    int(string[string.find("(") + 1:string.find(")")].split(",")[0].replace("D", "")))
congress["Total Republican Women"] = congress["Total Women"].apply(lambda string:
                                                                    int(string[string.find("(") + 1:string.find(")")].split(",")[-1].replace("R", "")))
congress = congress.drop(columns = ["Dates", "Women in the Senate", "Women in the House", "Total Women"], axis = 1)

In [58]:
congress.head()

,Congress,Start Date,End Date,Total Women in Senate,Democratic Women in Senate,Republican Women in Senate,Total Women in House,Democratic Women in House,Republican Women in House,Total Women in Congress,Total Democratic Women,Total Republican Women
0,65th,1917,1919,0,0,0,1,0,1,1,0,1
1,66th,1919,1921,0,0,0,0,0,0,0,0,0
2,67th,1921,1923,1,1,0,3,0,3,4,1,3
3,68th,1923,1925,0,0,0,1,0,1,1,0,1
4,69th,1925,1927,0,0,0,3,1,2,3,1,2

In [59]:
congress.dtypes

Congress                      object
Start Date                     int64
End Date                       int64
Total Women in Senate          int64
Democratic Women in Senate     int64
Republican Women in Senate     int64
Total Women in House           int64
Democratic Women in House      int64
Republican Women in House      int64
Total Women in Congress        int64
Total Democratic Women         int64
Total Republican Women         int64
dtype: object

## Dataset #4 OB/GYN Rate Per State, 2019-2021

In [60]:
obgyn1.shape

(60, 5)

In [61]:
obgyn1.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,data.HRSA.gov,data.HRSA.gov,data.HRSA.gov,data.HRSA.gov,data.HRSA.gov
1,"Selected Filters: 2020-2021 / M.D., Obstetrics...",NaN,NaN,NaN,NaN
2,State/Territory,"M.D., Obstetrics and Gynecology (County Level ...","Population, All (County Level File)","Rate (per 100,000 population)",Source
3,Alabama,518,4921532,10.53,AMA Physician Masterfile 2019; Census County P...
4,Alaska,87,731158,11.90,AMA Physician Masterfile 2019; Census County P...

In [62]:
obgyn1 = obgyn1.drop([0,1,2, 59])
obgyn1 = obgyn1.drop(columns = ['Unnamed: 1', 'Unnamed: 2', 'Unnamed: 4'])
obgyn1.columns = ['State', 'Rate (2019)']

obgyn2 = obgyn2.drop([0,1,2, 59])
obgyn2 = obgyn2.drop(columns = ['Unnamed: 1', 'Unnamed: 2', 'Unnamed: 4'])
obgyn2.columns = ['State', 'Rate (2020)']

obgyn3 = obgyn3.drop([0,1,2, 59])
obgyn3 = obgyn3.drop(columns = ['Unnamed: 1', 'Unnamed: 2', 'Unnamed: 4'])
obgyn3.columns = ['State', 'Rate (2021)']

In [63]:
obgyn4 = pd.merge(obgyn1, obgyn2, on='State')
obgyn = pd.merge(obgyn4, obgyn3, on='State')

In [64]:
obgyn = obgyn.drop([54,55,56,57,58,59,60,61])

In [65]:
obgyn.head()

        State Rate (2019) Rate (2020) Rate (2021)
0     Alabama       10.53       10.08       10.14
1      Alaska       11.90       12.01       12.83
2     Arizona        9.74       10.12       10.06
3    Arkansas        8.74        8.89        8.59
4  California       12.52       12.59       12.57

# Ethics & Privacy

In all of the datasets we have utilized, we have accessed these specific ones from public institutions or have already been labeled public-use datasets. Therefore, the subjects used in the research have already consented and answered all, if any, anonymity agreements or anything else necessary to protect their privacy. For the intent of use in this project, there are no additional steps for us to take to further participants’ privacies.
Beyond privacy concerns, we must consider the reliability of our data. If we are considering abortion rates, we must consider the possibility of underreporting and illegal abortions. Additionally it is possible that political agendas or compromises in data collecting infrastructure causing unreliable data. We will do the best we can to find the most complete and reliable data, while still considering the possibilities of bias or possible underreporting.

# Team Expectations


Read over the [COGS108 Team Policies](https://github.com/COGS108/Projects/blob/master/COGS108_TeamPolicies.md) individually. Then, include your group’s expectations of one another for successful completion of your COGS108 project below. Discuss and agree on what all of your expectations are. Discuss how your team will communicate throughout the quarter and consider how you will communicate respectfully should conflicts arise. By including each member’s name above and by adding their name to the submission, you are indicating that you have read the COGS108 Team Policies, accept your team’s expectations below, and have every intention to fulfill them. These expectations are for your team’s use and benefit — they won’t be graded for their details.

- We expect to meet at least once a week in person and another time again online, especially if there is a checkpoint in the next few days.
- In the case that our meetings are cut short, we expect to delegate work amongst each other respective to our availability and team contributions.
- We will do our best to stay on track, however we expect each other to be understanding of personal schedules and will do our best to accommodate one another.

# Project Timeline Proposal

Subject to change

| Meeting Date  | Meeting Time| Completed Before Meeting  | Discuss at Meeting |
|---|---|---|---|
| 2/3  |  4:30 PM | NA | Discuss possible topics, Work on Group Project Review | 
| 2/5  |  2:30 PM |  Brainstorm for possible topics | Discuss possible topics, determine what kind of datasets we should look for| 
| 2/8  | 3:30 PM  | Search for datasets, think about ways in which our research question could be elaborated | Discuss research question, look for datasets, delegate sections for project proposal  |
| 2/13  | 2 PM  | Submit Proposal, do more research on datasets | choose a few datasets, discuss how we will clean the data, delegate roles/work |
| 2/15  | 3:30 PM  | Wrangle Data | Check in to discuss and clarify our edits/ questions |
| 2/19  | 2 PM  | Continue to edit and wrangle data | Check-in to discuss and clarify our edits/ questions |
| 2/22  | 3:30 PM  | Review requirements for Checkpoint #1| Finish SetUp and Data Cleaning parts of the Checkpoint, delegate tasks |
| 2/26  | 2 PM  | Submit Checkpoint on the 25th | Meet to discuss next steps, delegate Tasks |
| 3/4  | 2 PM  | Data Analysis | Meet to Analyze the Data, delegate tasks for the Checkpoint |
| 3/7  | 3:30 PM  | Review and work on requirements for Checkpoint #2 |Check-in to discuss Data Analysis portion |
| 3/14  | 2 PM  | Submit Checkpoint #2 on the 10th, start working on the final report| Meet to discuss Final Report and film Video |
| 3/20 | Before 11:59 PM  | Continue to touch-up Final Report and Submit| Turn in Final Project & Group Project Survey |